 ///=====================================================================
//文件名称：gec.c文件
//框架提供：苏州大学嵌入式系统与物联网研究所（sumcu.suda.edu.cn）
//更新记录：20220525
//【备注】：与芯片无关
//=====================================================================
#include "gec.h"
void **  component_fun;
//======================================================================
//函数名称：Componentfun_Init
//函数返回：无
//参数说明：无
//功能概要：获取BIOS的API表
//======================================================================
void Componentfun_Init()
{
    component_fun=(void **)(MCU_RAM_ADDR_START+
                 GEC_COMPONENT_LST_START*MCU_SECTORSIZE);
    printf("  【User提示】：将进入User的main()执行...\r\n");
}


