#ifndef  TIMER_H       //防止重复定义（TIMER_H 开头)
#define  TIMER_H

#include <mcu.h>

//D1-H芯片的Timer可用模块定义
#define Timer0  (0)
#define Timer1  (1)

//============================================================================
//函数名称：timer_init
//函数返回：无
//参数说明： timer_No:时钟模块号  
//         time_ms:定时器中断的时间间隔，单位为毫秒。
//功能概要：时钟模块初始化
//============================================================================
void timer_init(uint8_t timer_No,uint32_t time_ms);

//============================================================================
//函数名称：timer_enable_int
//函数返回：无
//参数说明： timer_No:时钟模块号
//功能概要：时钟模块使能，开启时钟模块中断及定时器中断
//============================================================================
void timer_enable_int(uint8_t timer_No);

//============================================================================
//函数名称：timer_disable_int
//函数返回：无
//参数说明： timer_No:时钟模块号  
//功能概要：定时器中断除能
//============================================================================
void timer_disable_int(uint8_t timer_No);

//===================================================================
//函数名称：timer_get_int
//参数说明： timer_No:时钟模块号  
//功能概要：获取timer模块中断标志
//函数返回：中断标志 1=有对应模块中断产生;0=无对应模块中断产生
//===================================================================
uint8_t timer_get_int(uint8_t timer_No);

//============================================================================
//函数名称：timer_clear_int
//函数返回：无
//参数说明：timer_No:时钟模块号
//功能概要：定时器清除中断标志
//============================================================================
void timer_clear_int(uint8_t timer_No);

#endif       //防止重复定义（TIMER_H 结尾)