//=====================================================================
// 文件名称：isr.c（中断处理程序源文件）
// 框架提供：苏大嵌入式（sumcu.suda.edu.cn）
// 更新记录：20240817-20250301
// 功能描述：提供中断处理程序编程框架
// 移植规则：【固定】本工程07_AppPrg整个文件夹具备芯片无关性，差异体现在
//           05_UserBoard文件夹的User.h中
//=====================================================================
#include "includes.h"

// 本文件使用的内部函数声明
void SecAdd1(uint8_t *p);

//======================================================================
// 中断服务例程名称：UART_User_Handler
// 触发条件：UART_User串口收到一个字节触发
// 备    注：进入本程序后，可使用uart_get_re_int函数可再进行中断标志判断
//          （1-有UART接收中断，0-没有UART接收中断）
//======================================================================
void UART_User_Handler(void)
{
	// 【1】关中断
	DISABLE_INTERRUPTS;
	// 【2】声明临时变量
	uint8_t flag, ch;
	// 【3】判断是否为本中断触发
	if (!uart_get_re_int(UART_User))
		goto UART_User_Handler_exit;
	// 【4】确认是本中断触发，读取接到的字节赋给变量ch，flag是收到数据标志
	ch = uart_re1(UART_User, &flag); // 调用接收一个字节的函数，清接收中断位
	// 【5】根据flag判断是否真正收到一个字节的数据
	if (!flag)
		goto UART_User_Handler_exit; // 无数据，退出
	uart_send1(UART_User, ch);		 // 有数据，回发接收到的字节
									 // 【6】开中断
UART_User_Handler_exit:
	ENABLE_INTERRUPTS;
}

//=====================================================================
// 中断服务例程名称：TIMER_User_Handler（TIMER_User定时器中断服务例程）
// 触发条件：20ms时间到
// 功能概要：（1）每20ms中断触发本程序一次；
//         （2）达到一秒时，调用秒+1程序，计算“时、分、秒”
//          (3) 达到一秒时，蓝灯取反，运行指示
// 特别提示：（1）使用全局变量字节型数组gTime[3]，分别存储“时、分、秒”
//         （2）注意其中静态变量的使用
//=====================================================================
void TIMER_User_Handler(void)
{
	// 【1】关中断
	DISABLE_INTERRUPTS;
	// 【2】声明一个静态变量（20ms计数器）
	static uint8_t TimerCount = 0; // 静态变量（20ms计数器）需要初值
	// 【3】判断是否为本中断触发
	if (!timer_get_int(TIMER_User))
		goto TIMER_User_Handler_exit;
	// 【4】确认是本中断触发，TimerCount+1，判断是否调用秒+1程序
	TimerCount++; // 静态变量（20ms计数器）
	if (TimerCount >= 50)
	{
		TimerCount = 0;				// 静态变量（20ms计数器）清0
		SecAdd1((uint8_t *)g_Time); // 时、分、秒累加
		gpio_reverse(LIGHT_BLUE);	// 蓝灯作为运行指示灯
	}
	// 【5】清时钟溢出标志位，开总中断
TIMER_User_Handler_exit:
	timer_clear_int(TIMER_User); // 清时钟溢出标志位
	ENABLE_INTERRUPTS;			 // 开总中断
}

//======================================================================
// 中断服务例程名称：Cam_Handler（摄像头中断服务例程）
// 触发条件：摄像头模块得到一幅图片，产生本中断。
//        （1）摄像头模块时时刻刻采样，得到一幅图片存储在该模块的数据
//             缓冲区，在帧同步信号（VSYNC）脚，发出一个下降沿，通知外
//             接器件取图片数据。
//        （2）在硬件上，摄像头模块帧同步信号（VSYNC）脚接微处理器的
//             GPIO一个引脚（见user.h），初始化时，设定该引脚为GPIO
//             输入、下降沿中断。
// 功能概要：
//        （1）若g_img_pro_flag（图像正在处理标志）为1，说明上一帧图片
//             没有处理好，直接清中断标志后退出；
//        （2）若g_img_pro_flag不为1，说明上一帧图片已经处理好，将
//             g_img_pro_flag赋值1，同时，触发“CAM读取事件”，同步
//             图像读取线程。
//        （3）图像读取、推理线程、二次编程线程均使用g_img_pro_flag，
//             二次编程线程使用后，将之赋0（表示图像处理完成）。
// 使用说明：
//        （1）全局变量g_img_pro_flag
//        （2）使用CAM构件
//======================================================================
void Cam_Handler(void)
{
	// 【1】关中断
	DISABLE_INTERRUPTS;
	// 【2】若不是摄像头中断，退出
	if (!cam_get_int())
		goto Cam_Handler_Exit;
	// 【3】是CAM中断，清中断标志
	cam_clear_int();
	// 【4】判断图像处理标志（image processing flag），若为1，表示还没有处理完成
	if (g_img_pro_flag == 1)
		goto Cam_Handler_Exit;
	// 【5】g_img_pro_flag=0，图像已经处理完成，给图像处理标志赋值1，
	//      表示可读取图像处理，触发“CAM读取事件”CAM_READ_EVENT，以便及时读取
	if (cam_enabledata() == 1) // 有图像可读
	{
		g_img_pro_flag = 1;						//=1,表示可读取图像进行处理,=0,表示图像处理已完成
		event_send(g_EventWord, CAM_GET_EVENT); // 触发“CAM读取事件”
	}
	// 【6】开中断
Cam_Handler_Exit:
	ENABLE_INTERRUPTS;
}

// 本文件使用的内部函数

//===========================================================================
// 函数名称：SecAdd1
// 函数返回：无
// 参数说明：*p:为指向一个时分秒数组p[3]，p[2],秒；p[1],分，p[0],时
// 功能概要：秒单元+1，并处理时分单元（00:00:00-23:59:59)
//===========================================================================
void SecAdd1(uint8_t *p)
{
	// 【1】秒+1
	*(p + 2) += 1;
	// 【2】未到60秒，退出；到则清秒，分+1
	if (*(p + 2) < 60)
		goto SecAdd1_exit; // 使用goto向后跳，减少{}嵌套
	*(p + 2) = 0;		   // 到60秒，清秒，分+1
	*(p + 1) += 1;
	// 【3】未到60分，退出；到则清分，时+1
	if (*(p + 1) < 60)
		goto SecAdd1_exit;
	*(p + 1) = 0; // 到60分，清分，时+1
	*p += 1;
	// 【4】未到24时，退出；到则清时
	if (*p < 24)
		goto SecAdd1_exit;
	*p = 0; // 清时
SecAdd1_exit:
	__asm("nop");
}

/*
 【可复用性说明】
 本文件中的中断处理函数调用的均是相关设备封装好的具体构件，在更换芯片
 时，只需保证设备的构件接口一致，即可保证本文件的相关中断处理函数不做任何
 更改，从而达到芯片无关性的要求。
 */
