//======================================================================
//文件名称：main.c（应用工程主函数）
//框架提供：苏大嵌入式（sumcu.suda.edu.cn）
//版本更新：201206-251014
//功能描述：见本工程的..\01_Doc\readme.txt
//移植规则：【固定】
//======================================================================
#define GLOBLE_VAR
#include "includes.h"      //包含总头文件
int main(void)
{
	OS_start(thread_auto);  //启动RTOS并运行自启动线程
}   //main函数（结尾）


/*
 知识要素：
 （1）main.c是一个模板，该文件所有代码均不涉及具体的硬件和环境，通过调用构件
      实现对硬件的干预。
 （2）本文件中对宏GLOBLE_VAR进行了定义，所以在包含"includes.h"头文件时，会定
      义全局变量，在其他文件中包含"includes.h"头文件时，
      编译时会自动增加extern
 */
