//=====================================================================
//文件名称：ov7670.h
//功能概要：ov7670摄像头底层驱动构件头文件
//更新记录：20200809-20250218 
//=====================================================================
#ifndef CAM_H
#define CAM_H

//包含外部文件
#include "gpio.h"

//硬件连接见本文档API函数声明后部

//定义CAM的尺寸
#define CAMIMG_W 160   //最大240
#define CAMIMG_H 150   //最大240


//=====================================================================
//函数名称：cam_init（初始化）
//函数返回：0：配置成功
//          1：失败
//          2：读取到数据但是不正确，重新初始化一次
//参数说明：无
//功能概要：摄像头初始化相关配置
//=====================================================================
uint8_t cam_init();

//======================================================================
//程序名称：cam_enabledata
//函数功能：摄像头中断服务例程调用二次则有图像数据可取
//函数返回：1：有图像可读
//======================================================================
uint8_t cam_enabledata();

//=====================================================================
//函数名称：cam_getimg
//函数返回：无
//参数说明：w=图片宽度<240,h=图片高度<320,*point图像存放地址
//功能概要：获得指定大小(w*h)的RGB图像
//=====================================================================
void cam_getimg(uint16_t w,uint16_t h,uint16_t point[h][w]);

//=====================================================================
//函数名称：cam_enable_int
//函数返回：无
//参数说明：无
//功能概要：使能摄像头帧中断
//=====================================================================
void cam_enable_int();   

//=====================================================================
//函数名称：cam_disable_int
//函数返回：无
//参数说明：无
//功能概要：禁止摄像头帧中断
//=====================================================================
void cam_disable_int();   

//=====================================================================
//函数名称：cam_get_int
//函数返回：CAM帧中断（1或0）1表示引脚有CAM中断，0表示引脚没有CAM中断。
//参数说明：无
//功能概要：摄像头每采集一幅图像，产生本中断
//=====================================================================
uint8_t cam_get_int();

//=====================================================================
//函数名称：cam_disable_int
//函数返回：无
//参数说明：无
//功能概要：清楚摄像头帧中断标志
//=====================================================================
void cam_clear_int();


//硬件连接
#define cam_VSYNC       (PTE_NUM|10)  //帧传送结束
#define cam_FIFO_OE     (PTE_NUM|17)  //输出使能
#define cam_FIFO_RCK    (PTF_NUM|0)   //像素时钟
#define cam_FIFO_WRST   (PTF_NUM|1)	  //写信号复位
#define cam_FIFO_RRST   (PTF_NUM|2)	  //读信号复位
#define cam_FIFO_WR     (PTF_NUM|3)   //FIFO写使能
#define cam_DATA_IO_0   (PTD_NUM|0)   //FIFO数据接收的8个IO口
#define cam_DATA_IO_1   (PTD_NUM|1)
#define cam_DATA_IO_2   (PTD_NUM|2)
#define cam_DATA_IO_3   (PTD_NUM|3)
#define cam_DATA_IO_4   (PTD_NUM|4)
#define cam_DATA_IO_5   (PTD_NUM|5)
#define cam_DATA_IO_6   (PTD_NUM|6)
#define cam_DATA_IO_7   (PTD_NUM|7)
#define SCLK            (PTC_NUM|0)   //定义SCCB的时钟脚
#define SDIO            (PTC_NUM|1)	  //定义SCCB的数据脚
#define SCCB_ID         0X42  	      //OV7670的ID


#endif 
